In [1]:
import pandas as pd

In [3]:
# Leyendo el arhivo csv
df = pd.read_csv("StudentsPerformance.csv")

print("\033[1;34m" + "DATAFRAME" + "\033[0m\n")
df.head()

DATAFRAME

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# Seleccionar dos o mas columnas

In [5]:
# Seleccionar 2 columnas usando [[]]
print("\033[1;34m" + "USANDO [[]]" + "\033[0m\n")
df[['gender', 'math score']].head()

USANDO [[]]

   gender  math score
0  female          72
1  female          69
2  female          90
3    male          47
4    male          76

In [7]:
# Revisar el tipo de data de la selección
print("\033[1;35m" + "Revisar tipo de dato" + "\033[0m")
type(df[['gender', 'math score']])

Revisar tipo de dato

pandas.core.frame.DataFrame

In [13]:
# Seleccionar 2 o más columnas usando [[]]
print("\033[1;35m" + "Seleccionar 2 o más columnas con [[]]" + "\033[0m\n")
df[['gender', 'math score', 'reading score', 'writing score']]

Seleccionar 2 o más columnas con [[]]

     gender  math score  reading score  writing score
0    female          72             72             74
1    female          69             90             88
2    female          90             95             93
3      male          47             57             44
4      male          76             78             75
..      ...         ...            ...            ...
995  female          88             99             95
996    male          62             55             55
997  female          59             71             65
998  female          68             78             77
999  female          77             86             86

[1000 rows x 4 columns]

In [15]:
# No podemos seleccionar 2 o más columnas usando el "."
# ERROR
# df.gender, lunch

print("\033[1;35m" + "Seleccionar 2 o más columnas con ." + "\033[0m\n")
df.gender, df.lunch

Seleccionar 2 o más columnas con .

(0      female
 1      female
 2      female
 3        male
 4        male
         ...
 995    female
 996      male
 997    female
 998    female
 999    female
 Name: gender, Length: 1000, dtype: object,
 0          standard
 1          standard
 2          standard
 3      free/reduced
 4          standard
            ...
 995        standard
 996    free/reduced
 997    free/reduced
 998        standard
 999    free/reduced
 Name: lunch, Length: 1000, dtype: object)